In [9]:
import pandas as pd

In [15]:
#load the first file
part1 = pd.read_csv('part1.csv')

In [16]:
#view the file
part1.head()

   driverid First_Name Last_Name        City State    Zip Years with Licence
0      4532        Sam    Smith   Washington    DC  20001                   1
1     23456       Tony    Tegan   Washington    DC  20001                   1
2    235636      Erick     Jones  Washington    DC  20002                   2
3    354346      Blake   Martin   Washington    DC  20002                   9
4    123453        Pat     Vogel  Washington    DC  20003                  10

In [17]:
part2 = pd.read_csv('part2.csv')

In [18]:
part2.head()

,driverid,Age,Traffic Violations in the Past 6 months,Wears Glasses,Yearly Income,Unnamed: 5,Unnamed: 6
0,4532,23,Y,Y,"23,023",NaN,NaN
1,23456,24,N,N,"55,034",NaN,NaN
2,235636,43,N,N,"85,046",NaN,NaN
3,354346,34,N,Y,"15,233",NaN,NaN
4,123453,30,N,Y,"43,234",NaN,NaN

In [19]:
combo = pd.merge(part1, part2, how='inner', on=['driverid'])

In [20]:
combo.head()

,driverid,First_Name,Last_Name,City,State,Zip,Years with Licence,Age,Traffic Violations in the Past 6 months,Wears Glasses,Yearly Income,Unnamed: 5,Unnamed: 6
0,4532,Sam,Smith,Washington,DC,20001,1,23,Y,Y,"23,023",NaN,NaN
1,23456,Tony,Tegan,Washington,DC,20001,1,24,N,N,"55,034",NaN,NaN
2,235636,Erick,Jones,Washington,DC,20002,2,43,N,N,"85,046",NaN,NaN
3,354346,Blake,Martin,Washington,DC,20002,9,34,N,Y,"15,233",NaN,NaN
4,123453,Pat,Vogel,Washington,DC,20003,10,30,N,Y,"43,234",NaN,NaN

In [21]:
#Send to csv
combo.to_csv('combo.csv', index=False)